---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementGeometryCalculator.GetOptions
source: html/32e23dc2-66e7-2b76-3da2-e997279855c0.htm
---
# Autodesk.Revit.DB.SpatialElementGeometryCalculator.GetOptions Method

The options that control the calculation.

## Syntax (C#)
```csharp
public SpatialElementBoundaryOptions GetOptions()
```

## Returns
The options.